---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.ForwardIterator
source: html/f669145b-ba48-9386-e839-fbfee96d4224.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual GeomCombinationSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.